essays/vim/1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-28 Sun 23:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vim: Introduction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Anurag Peshne" />
<link rel="stylesheet" type="text/css" href="../../css/style.css" />
<link href='https://fonts.googleapis.com/css?family=Lato' rel='stylesheet' type='text/css'>
<link rel="canonical" href="https://anuragpeshne.github.io/essays/vim/1.html" />
</head>
<body>
<div id="content">
<h1 class="title">Vim: Introduction</h1>
<script> (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o), m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','//www.google-analytics.com/analytics.js','ga'); ga('create', 'UA-67524931-1', 'auto'); ga('send', 'pageview'); </script>

<div id="outline-container-orgeb7232d" class="outline-2">
<h2 id="orgeb7232d">Hello</h2>
<div class="outline-text-2" id="text-orgeb7232d">
<p>
Quick, look at the calendar, because today, if you are someone who spends more
than 6 hours a day in front of a text editor, your life is going to change. Let
me repeat that, you won't look at editing text the same way; if you manage to
hang around till the end, your brain will be rewired to demand nothing less than
a powerful editor like Vim.
</p>
</div>

<div id="outline-container-org14621fb" class="outline-3">
<h3 id="org14621fb">Why Vim</h3>
<div class="outline-text-3" id="text-org14621fb">
<p>
There are really just 3 types of editors:
</p>
<ol class="org-ol">
<li>Vim</li>
<li>Emacs</li>
<li>Everything else</li>
</ol>
<p>
Emacs is an magnificient text editor, make no mistake. If you can think of doing
any transformation of text&#x2013;writing code, sending emails, reading news, connecting
to databases, creating websites, taking notes&#x2013;Emacs does a brilliant job. Emacs
just isn't Vim<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. And this essay is about Vim.
</p>

<p>
Some of Vim's niche:
</p>
<ul class="org-ul">
<li>Vim has modal interface which makes editing text and navigation extremely efficient.</li>
<li>Vim command can be composed: if you know how to delete and know how to jump n lines
you can combine these two commands to delete n lines. Know how to copy and now you
know how to copy n lines.</li>
<li>Omnipresence: Whether you like or not, you will encounter Vim if you are working
with remote machines. It is pre-installed in almost all *NIX machines.</li>
<li>Fast, not just to start up but also to use.</li>
<li>Extensible: Vim was released in 1991 based on vi, which was first released in 1976.
And still according to Stack Overflow 2015 survey<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> it is 3rd most
popular text editor<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. This is possible due to great plugins developed by
individual contributors which keeps Vim competitive with newer editors.</li>
</ul>

<p>
If you are a power user of any other text editor-like Sublime, Notepad++,
atom-and you feel you do not need to learn anything new, that's okay, you are
better off spending your time in something else. Or maybe you want to know just
a few commands to make peace with Vim whiling sshing, or maybe want to hang around
to see what the hype about. There just a sincere request, please do not judge Vim
based on emulation done by other editors<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>. All the Vim emulation that I
have used, except for Evil mode in Emacs, simply suck. Besides, Vim is much more
than the keyboard bindings.
</p>
</div>
</div>
</div>
<div id="outline-container-org9aaca14" class="outline-2">
<h2 id="org9aaca14">Dive In, head first</h2>
<div class="outline-text-2" id="text-org9aaca14">
</div><div id="outline-container-org8289764" class="outline-3">
<h3 id="org8289764">Installation</h3>
<div class="outline-text-3" id="text-org8289764">
<p>
There is a very good chance that Vim is pre-installed on your system, so head
over to your terminal and hit <code>vim</code>. Unless you have already played around with
<code>.vimrc</code>, you will be greeted with a black (or any other solid color), dull splash
screen which may force you to think that Vim was indeed made in 1991 and wasn't
updated after that, except for a few <i>bug fixes</i>. Don't worry about it just yet,
you can make your Vim look like any of <a href="http://vimcolors.com/">these</a> quite easily.
</p>
</div>

<div id="outline-container-org4e23f10" class="outline-4">
<h4 id="org4e23f10">Lesson 0</h4>
<div class="outline-text-4" id="text-org4e23f10">
<p>
You can quit Vim using <code>:q</code>, yes, you need to press <code>:</code> too.
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
but it does a very good job in enacting Vim: <a href="https://www.emacswiki.org/emacs/Evil">Evil Mode</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://insights.stackoverflow.com/survey/2015#tech-editor">2015 Results</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
slipping to 4th position in 2016 in <i>Development Environments</i> which isn't actually text editor segment
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Trying Vintage mode in Sublime doesn't count as trying Vim.
</p></div></div>


</div>
</div><div id="disqus_thread"></div>
<script>
    var disqus_config = function () {
this.page.url = "https://anuragpeshne.github.io/essays/vim/1.html";
this.page.identifier = "/essays/vim/1.html";
};
    (function() {  // DON'T EDIT BELOW THIS LINE
        var d = document, s = d.createElement('script');

        s.src = '//anuragpeshne.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript></div>
<div id="postamble" class="status">
<p class="date">Date: 2017-05-28</p>
<p class="author">Author: Anurag Peshne</p>
<p class="date">Created: 2017-05-28 Sun 23:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
